app/controllers/main_controller.rb

SELECT `properties`.* FROM `properties`
---
  def property_list
  	@property = Property.all

SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1
---
  def property_details
    @property = Property.find(params[:p_id].to_i)